Revit 2027 API
LightType.GetLightShape Method
 Return a copy of an object derived from LightShape
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LightShape GetLightShape()
Public Function GetLightShape As LightShape
public:
LightShape^ GetLightShape()
member GetLightShape : unit -> LightShape
Return Value
LightShape
See Also
Reference
LightType Class
Autodesk.Revit.DB.Lighting Namespace